tutorials/single_phase_elastic/twoStepNoEikonal/pillarsSolidsVelocity/constant/mechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rho //solid density
{
    type        uniform;
    value       1200;
}

nu //poisson ratio
{ 
    type        uniform;
    value       0.49;
}

E //Youngs modulus
{
    type        uniform;
    value       5e3;
}


planeStress     no; 

// ************************************************************************* //
