tutorials/single_phase_elastic/twoStepNoEikonal/pillarsSolidsVelocity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3980;
        startFace       101889;
    }
    inlet
    {
        type            patch;
        nFaces          253;
        startFace       105869;
    }
    outlet
    {
        type            patch;
        nFaces          253;
        startFace       106122;
    }
    emptyFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          104132;
        startFace       106375;
    }
)

// ************************************************************************* //
